{
  "bands": [
    {
      "layer": "ITU",
      "label": "ELF",
      "fmin": 3,
      "fmax": 3e1,
      "img": "img/itu/elf.jpg",
      "info": "Extremely Low Frequency (ELF) waves range from 3 to 30 Hz and have wavelengths longer than the diameter of Earth. They are mainly used for communication with submerged submarines due to their ability to penetrate deep into water. Natural ELF signals occur in phenomena like Schumann resonances."
    },
    {
      "layer": "ITU",
      "label": "SLF",
      "fmin": 3e1,
      "fmax": 3e2,
      "img": "img/itu/slf.jpg",
      "info": "Super Low Frequency (SLF) waves span 30 to 300 Hz and can penetrate rock, soil, and water. They are primarily used in specialized military communication systems. SLF waves are also observed in natural geophysical processes."
    },
    {
      "layer": "ITU",
      "label": "ULF",
      "fmin": 3e2,
      "fmax": 3e3,
      "img": "img/itu/ulf.jpg",
      "info": "Ultra Low Frequency (ULF) waves range from 300 Hz to 3 kHz and are used in underground communication, such as mining. They can penetrate deep through rock and water. ULF signals can also be generated by earthquakes and geomagnetic storms."
    },
    {
      "layer": "ITU",
      "label": "VLF",
      "fmin": 3e3,
      "fmax": 3e4,
      "img": "img/itu/vlf.jpg",
      "info": "Very Low Frequency (VLF) spans 3 to 30 kHz and is used for long-range military communication. VLF waves can travel thousands of kilometers via the Earth–ionosphere waveguide. They are also used for navigation and time signal broadcasting."
    },
    {
      "layer": "ITU",
      "label": "LF",
      "fmin": 3e4,
      "fmax": 3e5,
      "img": "img/itu/lf.jpg",
      "info": "Low Frequency (LF) ranges from 30 to 300 kHz and is used for AM longwave broadcasting and maritime navigation. LF signals travel as ground waves, making them effective over long distances. They are reliable in most weather conditions."
    },
    {
      "layer": "ITU",
      "label": "MF",
      "fmin": 3e5,
      "fmax": 3e6,
      "img": "img/itu/mf.jpg",
      "info": "Medium Frequency (MF) spans 300 kHz to 3 MHz and includes the AM radio broadcast band. MF waves travel well via ground and skywave propagation, especially at night. They are also used in maritime and aeronautical communications."
    },
    {
      "layer": "ITU",
      "label": "HF",
      "fmin": 3e6,
      "fmax": 3e7,
      "img": "img/itu/hf.jpg",
      "info": "High Frequency (HF) covers 3 to 30 MHz and supports long-range communication via ionospheric reflection. It is popular in amateur radio, aviation, and international broadcasting. HF propagation depends strongly on solar activity."
    },
    {
      "layer": "ITU",
      "label": "VHF",
      "fmin": 3e7,
      "fmax": 3e8,
      "img": "img/itu/vhf.jpg",
      "info": "Very High Frequency (VHF) spans 30 to 300 MHz and is used for FM radio, TV broadcasts, and two-way communication. VHF signals travel mainly line-of-sight and are less affected by atmospheric noise. They are common in aviation and marine services."
    },
    {
      "layer": "ITU",
      "label": "UHF",
      "fmin": 3e8,
      "fmax": 3e9,
      "img": "img/itu/uhf.jpg",
      "info": "Ultra High Frequency (UHF) covers 300 MHz to 3 GHz and is used for mobile phones, Wi-Fi, and television. UHF signals can carry high data rates but have shorter ranges than VHF. They are widely used in urban environments."
    },
    {
      "layer": "ITU",
      "label": "SHF (Microwave)",
      "fmin": 3e9,
      "fmax": 3e10,
      "img": "img/itu/shf.jpg",
      "info": "Super High Frequency (SHF) spans 3 to 30 GHz and includes most microwave communication. It is used in radar, satellite links, and high-speed wireless networks. SHF waves require clear line-of-sight and are easily blocked by obstacles."
    },
    {
      "layer": "ITU",
      "label": "EHF (mmWave)",
      "fmin": 3e10,
      "fmax": 3e11,
      "img": "img/itu/ehf.jpg",
      "info": "Extremely High Frequency (EHF), or millimeter waves, range from 30 to 300 GHz. They are used in 5G networks, advanced radar, and space communication. EHF waves are very directional and suffer high atmospheric absorption."
    },
    {
      "layer": "ITU",
      "label": "THF",
      "fmin": 3e11,
      "fmax": 3e12,
      "img": "img/itu/thf.jpg",
      "info": "Tremendously High Frequency (THF) spans 300 GHz to 3 THz. This band is largely experimental, used in terahertz imaging, spectroscopy, and security scanning. THF research is advancing materials science and next-gen communications."
    },
    {
      "layer": "Telescope",
      "label": "COBE",
      "fmin": 3e10,
      "fmax": 3e14,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Cosmic_Background_Explorer_spacecraft_model.png/330px-Cosmic_Background_Explorer_spacecraft_model.png",
      "info": "The Cosmic Background Explorer (COBE) mapped the cosmic microwave background radiation. Launched in 1989, it confirmed the Big Bang theory with high precision. COBE earned its team the 2006 Nobel Prize in Physics."
    },
    {
      "layer": "Telescope",
      "label": "WMAP telescope",
      "fmin": 2.3e10,
      "fmax": 9.4e10,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/WMAP_spacecraft_diagram.jpg/250px-WMAP_spacecraft_diagram.jpg",
      "info": "The Wilkinson Microwave Anisotropy Probe (WMAP) measured tiny variations in the cosmic microwave background. Operating from 2001 to 2010, it improved our understanding of the universe’s age and composition. WMAP provided a detailed map of the early universe."
    },
    {
      "layer": "Telescope",
      "label": "Planck telescope",
      "fmin": 3e10,
      "fmax": 8.57e11,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Model_of_the_Planck_Satellite.jpg/250px-Model_of_the_Planck_Satellite.jpg",
      "info": "The Planck telescope, launched in 2009, studied the cosmic microwave background with unprecedented accuracy. It covered a wide range of frequencies to map the early universe. Planck data refined measurements of the universe's age and geometry."
    },
    {
      "layer": "Telescope",
      "label": "Herschel Space Observatory",
      "fmin": 4.464e11,
      "fmax": 5.455e12,
      "img": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Herschel_in_space_close_up_on_its_mirror_node_full_image.jpg",
      "info": "The Herschel Space Observatory observed the universe in far-infrared and submillimeter wavelengths. Active from 2009 to 2013, it studied star formation, galaxy evolution, and interstellar chemistry. Herschel had the largest mirror ever launched in space."
    },
    {
      "layer": "Telescope",
      "label": "Spitzer Space Telescope",
      "fmin": 1.875e12,
      "fmax": 8.333e13,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Spitzer_space_telescope.jpg/330px-Spitzer_space_telescope.jpg",
      "info": "The Spitzer Space Telescope, launched in 2003, observed in the infrared spectrum. It studied exoplanets, distant galaxies, and cosmic dust. Spitzer’s observations were crucial for understanding cool, faint objects in space."
    },
    {
      "layer": "Telescope",
      "label": "James Webb Space Telescope (JWST)",
      "fmin": 1.053e13,
      "fmax": 5.0e14,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/James_Webb_Space_Telescope_2009_top.jpg/960px-James_Webb_Space_Telescope_2009_top.jpg?20100307143500",
      "info": "The James Webb Space Telescope, launched in 2021, is the most powerful space observatory ever built. It focuses on infrared astronomy, peering into the early universe and studying exoplanet atmospheres. JWST’s large segmented mirror allows unparalleled sensitivity."
    },
    {
      "layer": "Telescope",
      "label": "Hubble Space Telescope (HST)",
      "fmin": 1.2e14,
      "fmax": 2.609e15,
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/HST-SM4.jpeg/330px-HST-SM4.jpeg",
      "info": "The Hubble Space Telescope, launched in 1990, revolutionized astronomy with visible and ultraviolet observations. It has captured iconic deep-space images and contributed to major scientific discoveries. Hubble remains active, complementing newer telescopes."
    },
    {
      "layer": "Natural",
      "label": "Earth Rotation",
      "fmin": 1.16e-5,
      "fmax": 1.16e-5,
      "img": "",
      "info": "The Earth's rotation corresponds to a frequency of about once per day. This extremely low frequency affects tides, weather patterns, and navigation systems. It is a fundamental timekeeping reference in astronomy and geophysics."
    },
    {
      "layer": "Natural",
      "label": "Tides",
      "fmin": 1.93e-5,
      "fmax": 1.93e-5,
      "img": "",
      "info": "Tidal frequencies are caused by the gravitational pull of the Moon and Sun. These oscillations influence ocean currents, ecosystems, and coastal erosion. They can also subtly affect Earth's crust and atmosphere."
    },
    {
      "layer": "Natural",
      "label": "Seismic Earth Hum",
      "fmin": 0.002,
      "fmax": 0.1,
      "img": "",
      "info": "Seismic Earth hum is a constant, low-frequency vibration of the planet. It is caused by ocean waves interacting with the sea floor and by atmospheric pressure changes. Scientists use it to study Earth's interior structure."
    },
    {
      "layer": "Natural",
      "label": "Schumann Resonances",
      "fmin": 7.83,
      "fmax": 45,
      "img": "",
      "info": "Schumann resonances are global electromagnetic resonances in the cavity between Earth's surface and ionosphere. They are primarily excited by lightning strikes. These resonances are important for monitoring global lightning activity and ionospheric conditions."
    },
    {
      "layer": "Natural",
      "label": "Lightning Whistlers",
      "fmin": 1000,
      "fmax": 10000,
      "img": "",
      "info": "Lightning whistlers are radio waves produced by lightning strikes that travel along Earth's magnetic field lines. Their frequency changes as they propagate, creating a descending tone. Scientists use them to study the magnetosphere and space weather."
    },
    {
      "layer": "Natural",
      "label": "Auroral Kilometric Radiation",
      "fmin": 50000,
      "fmax": 500000,
      "img": "",
      "info": "Auroral kilometric radiation (AKR) is radio emission generated by electrons in Earth's auroral regions. It is produced during geomagnetic storms and is detectable by spacecraft. AKR provides clues about particle acceleration in the magnetosphere."
    },
    {
      "layer": "Natural",
      "label": "Jovian Radio Bursts",
      "fmin": 1e5,
      "fmax": 4e7,
      "img": "",
      "info": "Jupiter produces intense radio bursts due to its strong magnetic field and volcanic activity on its moon Io. These emissions are detectable from Earth with radio telescopes. They help scientists study Jupiter's magnetosphere."
    },
    {
      "layer": "Natural",
      "label": "Solar Radio Bursts",
      "fmin": 1e6,
      "fmax": 3e8,
      "img": "",
      "info": "Solar radio bursts occur when energetic particles from the Sun interact with its atmosphere and magnetic fields. They can disrupt radio communications on Earth. These bursts are closely monitored for space weather forecasting."
    },
    {
      "layer": "Natural",
      "label": "Hydrogen 21 cm Line",
      "fmin": 1.4204058e9,
      "fmax": 1.4204058e9,
      "img": "",
      "info": "The hydrogen 21 cm line is a spectral line emitted by neutral hydrogen atoms. It is a crucial tool for mapping the structure of galaxies. Radio astronomers use it to study the Milky Way and the large-scale universe."
    },
    {
      "layer": "Natural",
      "label": "Water Maser",
      "fmin": 22.235e9,
      "fmax": 22.235e9,
      "img": "",
      "info": "Water masers are natural microwave lasers produced by water molecules in space. They are found in star-forming regions, around evolved stars, and in galactic nuclei. Astronomers use them to measure cosmic distances with high precision."
    },
    {
      "layer": "Natural",
      "label": "OH Maser",
      "fmin": 1.612e9,
      "fmax": 1.612e9,
      "img": "",
      "info": "OH masers are microwave emissions from hydroxyl molecules in interstellar clouds. They are often associated with regions of massive star formation. Their properties help astronomers study the dynamics of molecular clouds."
    },
    {
      "layer": "Natural",
      "label": "Cosmic Microwave Background",
      "fmin": 1e11,
      "fmax": 3e11,
      "img": "",
      "info": "The cosmic microwave background (CMB) is the afterglow of the Big Bang. It is nearly uniform radiation present throughout the universe. Studying the CMB reveals details about the early universe's composition and evolution."
    },
    {
      "layer": "Natural",
      "label": "Thermal IR from Earth",
      "fmin": 3e12,
      "fmax": 4e13,
      "img": "",
      "info": "Earth emits thermal infrared radiation as it radiates heat into space. This emission plays a major role in Earth's energy balance. Satellites monitor it for climate and weather studies."
    },
    {
      "layer": "Natural",
      "label": "Zodiacal Light",
      "fmin": 4e14,
      "fmax": 8e14,
      "img": "",
      "info": "Zodiacal light is faint sunlight scattered by interplanetary dust in the solar system. It is visible from dark locations just before sunrise or after sunset. Studying it helps astronomers understand dust distribution in the solar system."
    },
    {
      "layer": "Natural",
      "label": "Auroral UV Emissions",
      "fmin": 8e14,
      "fmax": 1.5e15,
      "img": "",
      "info": "Auroral UV emissions are ultraviolet light produced by energetic particles colliding with Earth's atmosphere. They occur during geomagnetic storms and are often associated with visible auroras. Spacecraft monitor these emissions to study upper atmospheric processes."
    },
    {
      "layer": "Natural",
      "label": "Solar UV",
      "fmin": 3e15,
      "fmax": 1e16,
      "img": "",
      "info": "Solar ultraviolet radiation comes from the Sun’s surface and atmosphere. It plays a key role in producing Earth's ozone layer but can also cause skin damage. Monitoring solar UV is important for health and climate studies."
    },
    {
      "layer": "Natural",
      "label": "Solar X-ray Flares",
      "fmin": 3e16,
      "fmax": 3e18,
      "img": "",
      "info": "Solar X-ray flares are sudden bursts of high-energy radiation from the Sun. They occur during magnetic reconnection events in the solar corona. These flares can disrupt satellite operations and radio communications."
    },
    {
      "layer": "Natural",
      "label": "Gamma-ray Bursts",
      "fmin": 1e19,
      "fmax": 1e22,
      "img": "",
      "info": "Gamma-ray bursts (GRBs) are the most energetic explosions in the universe. They originate from collapsing massive stars or neutron star mergers. GRBs release more energy in seconds than the Sun will emit in its entire lifetime."
    },
    {
      "layer": "Natural",
      "label": "Pulsar Emissions",
      "fmin": 1e6,
      "fmax": 1e22,
      "img": "",
      "info": "Pulsars are rapidly rotating neutron stars that emit beams of electromagnetic radiation. Their emissions span radio to gamma-ray frequencies. Pulsars are used as precise cosmic clocks and to study extreme physics."
    },
    {
      "layer": "Human",
      "label": "Submarine Comms (ELF)",
      "fmin": 76,
      "fmax": 76,
      "img": "",
      "info": "ELF communication at around 76 Hz is used by some navies to contact submerged submarines. The extremely low frequency allows penetration through seawater to great depths. Data rates are extremely slow, suitable only for brief coded messages."
    },
    {
      "layer": "Human",
      "label": "AM Broadcast",
      "fmin": 5.3e5,
      "fmax": 1.71e6,
      "img": "",
      "info": "AM broadcast radio operates in the medium frequency range from 530 kHz to 1710 kHz. It is widely used for news, talk, and music broadcasting. AM signals can travel long distances, especially at night via skywave propagation."
    },
    {
      "layer": "Human",
      "label": "Shortwave Broadcast",
      "fmin": 3e6,
      "fmax": 3e7,
      "img": "",
      "info": "Shortwave broadcasting uses high frequencies from 3 to 30 MHz. These signals can bounce off the ionosphere and travel across continents. It is used for international broadcasting, emergency communication, and amateur radio."
    },
    {
      "layer": "Human",
      "label": "FM Radio",
      "fmin": 8.8e7,
      "fmax": 1.08e8,
      "img": "",
      "info": "FM radio broadcasts operate from 88 to 108 MHz. They provide high-fidelity sound and are less prone to static than AM. FM signals travel line-of-sight, making them best for local and regional coverage."
    },
    {
      "layer": "Human",
      "label": "Analog TV VHF",
      "fmin": 5.4e7,
      "fmax": 2.16e8,
      "img": "",
      "info": "Analog TV in the VHF band historically spanned roughly 54 to 216 MHz. It was used for decades before digital television replaced it in most countries. These signals were susceptible to interference and ghosting."
    },
    {
      "layer": "Human",
      "label": "Air Traffic Comms",
      "fmin": 1.18e8,
      "fmax": 1.37e8,
      "img": "",
      "info": "Air traffic communication frequencies between 118 and 137 MHz are used for voice communication between pilots and air traffic controllers. The AM mode is used for clarity even in weak signal conditions. Reliable communication is critical for flight safety."
    },
    {
      "layer": "Human",
      "label": "Marine VHF",
      "fmin": 1.56e8,
      "fmax": 1.62e8,
      "img": "",
      "info": "Marine VHF radio is used for ship-to-ship, ship-to-shore, and safety communications. Operating from 156 to 162 MHz, it supports navigation, distress calls, and port operations. Channels are standardized internationally."
    },
    {
      "layer": "Human",
      "label": "2m Amateur Radio",
      "fmin": 1.44e8,
      "fmax": 1.48e8,
      "img": "",
      "info": "The 2-meter amateur radio band from 144 to 148 MHz is popular among ham radio operators. It supports local voice communication, digital modes, and satellite contacts. Repeaters extend its range beyond line-of-sight."
    },
    {
      "layer": "Human",
      "label": "GPS L1/L2/L5",
      "fmin": 1.227e9,
      "fmax": 1.575e9,
      "img": "",
      "info": "GPS uses multiple frequencies, including L1 (1.575 GHz), L2 (1.227 GHz), and L5 (1.176 GHz). These signals enable precise global positioning for navigation, surveying, and timing. Civilian and military signals use different modulation schemes."
    },
    {
      "layer": "Human",
      "label": "Wi-Fi 2.4 GHz",
      "fmin": 2.4e9,
      "fmax": 2.5e9,
      "img": "",
      "info": "Wi-Fi in the 2.4 GHz band is widely used for home and public wireless networks. It offers good range but is prone to interference from other devices. This band is shared with Bluetooth and microwave ovens."
    },
    {
      "layer": "Human",
      "label": "Wi-Fi 5 GHz",
      "fmin": 5.15e9,
      "fmax": 5.85e9,
      "img": "",
      "info": "Wi-Fi in the 5 GHz band provides faster speeds and less interference than 2.4 GHz. Its shorter range makes it ideal for high-density indoor environments. Many modern routers support both 2.4 and 5 GHz bands."
    },
    {
      "layer": "Human",
      "label": "Bluetooth",
      "fmin": 2.4e9,
      "fmax": 2.483e9,
      "img": "",
      "info": "Bluetooth operates in the 2.4 GHz ISM band for short-range device communication. It connects peripherals like headphones, keyboards, and sensors. Low-power operation makes it suitable for battery-powered devices."
    },
    {
      "layer": "Human",
      "label": "Weather Radar",
      "fmin": 5.6e9,
      "fmax": 5.65e9,
      "img": "",
      "info": "Weather radar systems use frequencies around 5.6 GHz to detect precipitation and storm structures. The radar measures reflected signals from raindrops, snow, or hail. It is crucial for weather forecasting and severe storm warnings."
    },
    {
      "layer": "Human",
      "label": "Airport Radar",
      "fmin": 2.7e9,
      "fmax": 2.9e9,
      "img": "",
      "info": "Airport surveillance radar operates around 2.7 to 2.9 GHz to track aircraft positions. It provides real-time location data to air traffic control. These systems are critical for safe airspace management."
    }
  ]
}
